[{"state":"Alabama","city":"Montgomery","lat":32.377716,"lon":-86.300568,"lockdown_method":"declared state of emergency on March 13, all public schools would be closed from March 18 to April 6 "},{"state":"Alaska","city":"Juneau","lat":58.301598,"lon":-134.420212,"lockdown_method":"state-run libraries, museums and archives will be closed through the end of March, and  boarding school programmes to send students home. Schools have been closed to students until March 30. Some municipalities, such as state capital Anchorage, ordered bars, eateries and public spaces to close before federal officials expanded the order statewide, starting on March 18."},{"state":"Arizona","city":"Phoenix","lat":33.448143,"lon":-112.096962,"lockdown_method":"the closure of Arizona schools on March 13. Schools will be closed from March 16 through March 27. The closure does not affect childcare centres. cancel  events with 50 or more people."},{"state":"Arkansas","city":"Little Rock","lat":34.746613,"lon":-92.288986,"lockdown_method":"Restaurants can remain open \"on their own choosing and based upon market demand\" as a press conference.Ordering schools to close on March 17 through March 27.  Many businesses in Arkansas have closed of their own choice."},{"state":"California","city":"Sacramento","lat":38.576668,"lon":-121.493629,"lockdown_method":"March 23 the deployment of the National Guard, a branch of the US military that operates domestically, typically in times of national disasters, to aid California, Washington State and New York.  Ordering all 40 million Californians to stay home, venturing outside only for essential jobs, errands and some exercise. The closure of restaurants on March 17, following previous orders to close bars, breweries, wineries and similar establishments.Restaurants will still be able to deliver carry-out orders. Food trucks, a staple of California's food industry, are currently allowed to remain open. Protect consumers against price gouging, allow for health care workers to come from out of state to assist at health care facilities, and give health care facilities the flexibility to plan and adapt to accommodate incoming patients.\" Businesses that do not provide \"essential\" services have also been ordered to close."},{"state":"Colorado","city":"Denver","lat":39.739227,"lon":-104.984856,"lockdown_method":"Following other states in prohibiting on-site dining at eateries and bars in Colorado, while still allowing takeout service, effective the morning of March 1. Up to five customers will be allowed inside at any one time to pick up orders, but they must maintain 1.8m distance. On March 18, Polis ordered all in-person schooling to end until at least April 17. He also banned crowds of more than 10 people."},{"state":"Connecticut","city":"Hartford","lat":41.764046,"lon":-72.682198,"lockdown_method":"Restaurants and cinemas will close on March 16. On March 18,places of public amusement, including malls, bowling alleys and amusement parks will close.All public schools to close until at least March 31."},{"state":"Delaware","city":"Dover","lat":39.157307,"lon":-75.519722,"lockdown_method":"On March 16,all restaurants and bars to reduce service to carryout and delivery. schools to close for two weeks, beginning, March 16. "},{"state":"Hawaii","city":"Honolulu","lat":21.307442,"lon":-157.857376,"lockdown_method":"On March17, Bars,clubs will close and only offer order takeout food. Public attractions, state libraries and parks have also been closed. Hawaii imposed a mandatory 14-day quarantine of all people travelling to the state, including returning residents. Public schools extended spring holidays on March 13, with students expected to return in early April."},{"state":"Florida","city":"Tallahassee","lat":30.438118,"lon":-84.281296,"lockdown_method":"All public schools closed as of March 16 until March 30, which was later extended to April 15.Public universities will finish their courses online. All bars and nightclubs across Florida to close as of 5pm local on March 17 for the next 30 days, while restricting restaurant occupancy to 50 percent and ordering that patrons should be separated by a distance of at least 1.8 metres. And bars that serve food can remain open. Resisting calls to close beaches in the state, but has urged caution for vacationers celebrating spring break. "},{"state":"Georgia","city":"Atlanta","lat":33.749027,"lon":-84.388229,"lockdown_method":"All schools will close from March 18 through the end of the month, with some localities stopping classroom instruction on March 16. closing restaurants, bars and other businesses where people gather as of March 19. Setting up mobile housing units for people who need to be quarantined but can't stay in their homes. "},{"state":"Idaho","city":"Boise","lat":43.617775,"lon":-116.199722,"lockdown_method":"Urging people not to gather in groups of more than 10. He has also advised residents not to eat at restaurants. Escalating awareness and preparedness."},{"state":"Illinois","city":"Springfield","lat":39.798363,"lon":-89.654961,"lockdown_method":"Issuing a statewide \"stay-at-home\" order，On March 20. All non-essentials businesses will be closed and residents are told to stay home, but are still permitted to go to the grocery store, pharmacy, doctors office and perform other necessary tasks. On March 13, ordering all public and private schools, kindergarten through grade 12, to close until March 30. On March 16,limitting all crowd sizes to under 50, applying specifically to fitness centers, bowling alleys, private clubs and theatres."},{"state":"Indiana","city":"Indianapolis","lat":39.768623,"lon":-86.162643,"lockdown_method":"On March 16, closing restaurants, bars and nightclubs through the month.As of March 15, 273 public school districts have closed or moved instruction online."},{"state":"Iowa","city":"Des Moines","lat":41.591087,"lon":-93.603729,"lockdown_method":"On March 17, ordering bars, eateries and other facilities such as gyms to close for two weeks, but they can continue delivery and pick-up services.Gatherings of 10 or more are also banned, and Reynolds recommended schools close for four weeks. "},{"state":"Kansas","city":"Topeka","lat":39.048191,"lon":-95.677956,"lockdown_method":"Banning gather of 50 or more on March 16 for two months.Baning dine-in services at restaurants and bars."},{"state":"Kentucky","city":"Frankfort","lat":38.186722,"lon":-84.875374,"lockdown_method":"On March 6,closures of bars and restaurants on March 16.All schools are closed until at least April 6.An important horse racing event, has been postponed until September 5. "},{"state":"Louisiana","city":"Baton Rouge","lat":30.457069,"lon":-91.187393,"lockdown_method":"On March 16, all restaurants and bars close while still allowing for delivery and takeout, and he limited gatherings to 50 or less people. Also close the casinos and cinemas."},{"state":"Maine","city":"Augusta","lat":44.307167,"lon":-69.781693,"lockdown_method":"On March 15, announcing the emergency and after 3 days,banning gatherings of more than 10 people.Ordering Bars and restaurants to end dine-in services and non-essential businesses were urged to close. Recommending that schools stop classroom instruction."},{"state":"Maryland","city":"Annapolis","lat":38.978764,"lon":-76.490936,"lockdown_method":"Stricting closures on public spaces such as bars, restaurants, nightclubs and cinemas on March 16, with restaurants offering only takeout food. All public schools in the region were closed as of March 16.Ordering that the state's casinos and racetracks be closed for the foreseeable future. Gatherings of over 50 people have also been suspended.On March 23, urging residents not to go outside unless absolutely necessary and all non-essential businesses to close by 5PM, local time."},{"state":"Massachusetts","city":"Boston","lat":42.358162,"lon":-71.063698,"lockdown_method":"Declaring a state of emergency on March 10. Limitting gatherings to 25 people on March 15 and closed bars and restaurants on March 17, effective until April 6.Currently a three-week school closure in the state for all public schools, with residential and day schools for special-needs students unaffected.Authorizing pharmacies to create and sell hand sanitiser over the counter, and the state has ordered hospitals to cancel non-essential elective procedures, among other measures.Considering to have adopted one of the most aggressive responses to the epidemic."},{"state":"Michigan","city":"Lansing","lat":42.733635,"lon":-84.555328,"lockdown_method":"Closing all nonessential public spaces, limiting groups to 50 or less, and ordered bars and restaurants to close except for takeout and delivery services as of March 16.  announcing  a stay-at-home order for Michigan on March 23, effective at 12:01AM on March 24 banning all public gatherings and keeping non-essential workers from going to their jobs. Increasingly strong action to mitigate the crisis since its first confirmed case of coronavirus on March 10.  ordering the closure of all K-12 public schools until April 6. "},{"state":"Minnesota","city":"St. Paul","lat":44.955097,"lon":-93.102211,"lockdown_method":"Ordering schools to close on March 15 and restaurants and bars to close as of 5pm March 17, along with other public venues such as gyms, effective through March 27. Delivery and pickup services are allowed to continue"},{"state":"Mississippi","city":"Jackson","lat":32.303848,"lon":-90.182106,"lockdown_method":"Planning to confront the coronavirus during a streamed press conference on March 16, in which he urged all schools to extend their spring holidays through March 20."},{"state":"Missouri","city":"Jefferson City","lat":38.579201,"lon":-92.172935,"lockdown_method":"Declaring a state of emergency in Missouri on March 13, and ordered the closure of all casinos on March 17."},{"state":"Montana","city":"Helena","lat":46.585709,"lon":-112.018417,"lockdown_method":"Ordering a state of emergency on March 12.Three days later, he ordered schools to close through March 27. Visits to nursing homes have also been limited, and the governor strongly recommended gatherings be limited to 50 people or less."},{"state":"Nebraska","city":"Lincoln","lat":40.808075,"lon":-96.699654,"lockdown_method":"Limitting gatherings to 10 people or less March 16, but said that businesses can remain open."},{"state":"Nevada","city":"Carson City","lat":39.163914,"lon":-119.766121,"lockdown_method":"Announcing a state of emergency on March 12. Major casinos and hotels in Las Vegas announced the indefinite suspension of operations until further notice on March 17.All non-essential services in the state should close, and gatherings and crowded events should be avoided or postponed. "},{"state":"New Hampshire","city":"Concord","lat":43.206898,"lon":-71.537994,"lockdown_method":" Declaring a state of emergency in New Hampshire on March 13. Ordering closed for three weeks starting on March 16, and transitioned to remote education.Banned gatherings of 50 or more people as of Monday, and has ended dining in eateries.Delivery will still be an option from restaurants that provide it."},{"state":"New Jersey","city":"Trenton","lat":40.220596,"lon":-74.769913,"lockdown_method":"Announcing that bars, restaurants and cinemas will close as of March 16. Also limited recreational and social gatherings to 50 people. Declaring a state of emergency on March 9, also ordered all schools to close by March 18, ordering all in-person university courses to cease.On March 21， All non-essential retail businesses close their stores and almost all state residents stay home to curb the spread of the coronavirus. "},{"state":"New Mexico","city":"Santa Fe","lat":35.68224,"lon":-105.939728,"lockdown_method":"Limitting bars and eateries to 50 percent of their seating capacity. Similar to cases in other states, all occupied tables must be at least six feet (1.8m) apart.Gatherings of 100 people or more are prohibited. Casinos and horse tracks in the state will also be closed. Public schools were closed for three weeks starting March 16.Officials had declared a public health emergency on March 11."},{"state":"North Carolina","city":"Raleigh","lat":35.78043,"lon":-78.639099,"lockdown_method":"On March 17，all bars and restaurants will close in North Carolina, while keeping takeout and delivery operations open. closing schools for two weeks starting March 16, six days after declaring a state of emergency. "},{"state":"North Dakota","city":"Bismarck","lat":46.82085,"lon":-100.783318,"lockdown_method":"A state of emergency on March 13 and announced two days later that K-12 schools will shut down for a week."},{"state":"New York","city":"Albany","lat":42.652843,"lon":-73.757874,"lockdown_method":" Restaurants and cinemas will close as of March 16 and limit recreational and social gatherings to 50 people.  On March 16,  closing schools statewide.On March 20 told all non-essential workers to stay home and ordered the closure of tattoo parlours, nail salons and barber shops, effective March 21 at 8pm local time.On March 22 the National Guard would be deployed to assist in efforts to contain the virus in New York, along with California and Washington State."},{"state":"Ohio","city":"Columbus","lat":39.961346,"lon":-82.999069,"lockdown_method":"closed all bars and dine-in eateries in Ohio from 9pm onward on March 15, allowing for restaurants with carry-out and delivery options to continue operation. Should there be lines for takeout orders, customers will need to remain 1.8m apart, Gatherings of more than 50 people have been banned. Schools have also been closed for at least three weeks, issued a shelter in place order on March 22, urging residents not to leave their homes unless absolutely necessary. The order also closed all non-essential businesses. "},{"state":"Oklahoma","city":"Oklahoma City","lat":35.492207,"lon":-97.503342,"lockdown_method":"declared a state of emergency on March 15. order encourages state government agencies to establish work-from-home policies. recommended that Oklahomans use \"common sense\" to limit the spread of the virus. "},{"state":"Oregon","city":"Salem","lat":44.938461,"lon":-123.030403,"lockdown_method":"ordered the closure of bars and restaurants to all service except takeout across the state, as well as limiting gatherings to 25 people and less. Oregon schools closed on March 15 to coincide with preplanned holidays, and were to remain closed until at least April 28."},{"state":"Pennsylvania","city":"Harrisburg","lat":40.264378,"lon":-76.883598,"lockdown_method":"ordered K-12 public schools to close for two weeks starting on March 16. ordered all restaurants and bars in the counties of Allegheny, Bucks, Chester, Delaware and Montgomery, where most of the state's major population centres are found, to close their dine-in facilities for two weeks, but later extended the order statewide. strongly urged non-essential businesses - such as recreation and entertainment facilities - to close. Statewide crowd limitation orders have not been given, but the city of Philadelphia, as of March 12, has banned crowds of more than 1,000. Officials also \"strongly encouraged\" suspensions of gatherings of over 10 people. "},{"state":"Rhode Island","city":"Providence","lat":41.830914,"lon":-71.414963,"lockdown_method":"On March 10, declared a state of emergency. dine-in service will end at all bars and restaurants as of March 17, until at least March 30. As with other states, takeout services would remain an option. closed schools until April 3, with many expected to offer remote learning.  recommended that gatherings of 25 or more be banned. "},{"state":"South Carolina","city":"Columbia","lat":34.000343,"lon":-81.033211,"lockdown_method":"declared a state of emergency on March 13, followed by the March 14 cancelling of public schools through the month of March. Restaurant dining rooms will also be closed, as of March 18, McMaster announced. Takeout and delivery will still be available, in line with measures taken by other states. Other businesses and sporting organisations have closed their doors or suspended operations indefinitely."},{"state":"South Dakota","city":"Pierre","lat":44.367031,"lon":-100.346405,"lockdown_method":"Ordered on March 13 that schools close for at least a week, extending the order for another week on March 17. Ordered non-essential personnel in state government to work from home. the restaurant and bar closures are not currently needed in the state, because instances of community spread have not yet been confirmed. South Dakota State University has extended its spring holiday through March 23, when all classes will be temporarily moved online. "},{"state":"Tennessee","city":"Nashville","lat":36.16581,"lon":-86.784241,"lockdown_method":"declared a state of emergency on March 12, urged schools on March 16 to close by the end of the week and remain closed through the end of March. Bars, restaurants and other public establishments have not yet been ordered to close, however, the governer strongly discouraged groups of more than 250 on March 13. Certain localities, such as the state capital Nashville, agreed to close bars and limit restaurant capacity in line with mandates in other states."},{"state":"Texas","city":"Austin","lat":30.27467,"lon":-97.740349,"lockdown_method":"declared a state of disaster on March 13, but has largely allowed cities, counties and school districts to adopt proprietary approaches to the virus. implemented restrictions on visitors to elderly care facilities, hospitals, prisons, and daycare centres. Officials have also waived standardised testing requirements for public schools. Certain localities have cancelled classes and closed restaurants, bars and other locales. Others, including smaller towns, have not."},{"state":"Utah","city":"Salt Lake City","lat":40.777477,"lon":-111.888237,"lockdown_method":"on March 12, recommended a restriction on public gatherings of 100 people or less, while people saying people over 60 should limit gatherings to under 20 people. \"soft closure\" of public schools for two weeks that began on March 16. Teachers were given two days to determine how to move classes online. The governor has yet to mandate that businesses close, but many restaurants have started to offer delivery and carryout services on their own."},{"state":"Vermont","city":"Montpelier","lat":44.262436,"lon":-72.580536,"lockdown_method":"issued on March 16 a state of emergency and announced statewide closures of bars and restaurants. Delivery and pick-up will continue. banned gatherings of 50 or more people and limited venues to operate at 50 percent capacity. Schools were ordered to close by March 18."},{"state":"Virginia","city":"Richmond","lat":37.538857,"lon":-77.43364,"lockdown_method":"on March 12, declared a state of emergency in Virginia. The next day, officials closed all schools through March 27. issued an order prohibiting more than 10 patrons in restaurants, fitness centres, and theatres at one time."},{"state":"Washington","city":"Olympia","lat":47.035805,"lon":-122.905014,"lockdown_method":"declared  a state of emergency. On March 15, all bars, restaurants, recreational and entertainment facilities were ordered closed for two weeks. Officials also limited gatherings to under 50 people. more restrictions on elderly and assisted living facilities, including limiting the number of visitors, keeping visitors in patient rooms and reviewing employees for virus symptoms. These regulations will be in place until midnight on April 9. Schools closed March 15, and are expected to open again on April 27. The National Guard would be deployed  "},{"state":"West Virginia","city":"Charleston","lat":38.336246,"lon":-81.612328,"lockdown_method":"declared a state of emergency on March 16 (ease rules on staffing and purchasing, the governor's office explained.) Justice has closed schools through March 27. Bars, restaurants and casinos have also been closed. "},{"state":"Wisconsin","city":"Madison","lat":43.074684,"lon":-89.384445,"lockdown_method":"announced on March 16 that bars and restaurants would close and gatherings of 10 or more people would be banned as of March 17, allowing for delivery and takeout. Schools are closed, with a tentative reopening for April 6. "},{"state":"Wyoming","city":"Cheyenne","lat":41.140259,"lon":-104.820236,"lockdown_method":"recommended that schools be closed through at least April 3. rder the same business closures as other states."},{"state":"District of Columbia","city":"Washington","lat":38.9072,"lon":-77.0369,"lockdown_method":"strict closures on public spaces such as bars, restaurants, nightclubs and cinemas on March 15, offering only takeout food. suspended public service activities such as street sweeping and is encouraging all government employees to work from home.  declared a public health emergency on March 11. All public schools in the region are closed as of March 16."}]